Public Member Functions | Public Attributes | List of all members
API_ElemPartId Struct Reference
Element Manager
Identify a part of an element. It's valid for PolyRoof and Morph only. More...
#include <APIdefs_Elements.h>
 Public Member Functions
 bool  | operator== (const API_ElemPartId &right) const
 bool  | operator!= (const API_ElemPartId &right) const
 ULong  | GenerateHashValue () const
 Public Attributes
 UInt32  | main
 UInt32  | sub
 Int32  | floor
Detailed Description
Identify a part of an element. It's valid for PolyRoof and Morph only.